%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%% 本程序是承接files_rename_read程序，在其读取了文件名字写入Excel文件中 %%%%
%%% 然后在Excel修改完名称后，本程序是用于将修改完后的Excel文件中的名字变 %%%%%
%%% 量重新给对应文件命名。为了不破坏原本的文件，选择新的文件夹，将文件完整 %%%%
%%% 的复制为重新命名后的文件。%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%% author:yetwanng; date:2018-07-14%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

path ='D:\my_data-201508-201710\test-data\IV-test\20170702\';
%需要重命名的文件所在的地址。此处应当注意文件地址中不要出现空格，否则程序会报错

Files = dir(strcat(path,'*.xlsx'));
%利用dir函数读取相应路径下的特定文件名，我的是xlsx文件

[data,file_id]  = xlsread('C:\Users\ye\Desktop\matlab_rename_data.xlsx', 'sheet1', 'A1:A78');
%重新读取的修改好的名字变量。
%这里可以指定读取的具体单元格
%比如采用xlsread('PATH', 'sheet1', 'A1:A78')这种写法也可

 LengthFiles = length(Files); 
for i=1:LengthFiles  
    x1=  Files(i).name;
    x2= file_id{i};
    %注意此处是大括号而不是小括号因为file_id(i)是cell类型但是file_id{i}是string类型
    copyfile([path x1],['D:\处理好的数据\' x2]);
    %复制到“处理好的数据”文件夹中，请确保该路径有相应文件夹
end 
clear;
clc;