
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%% 本程序是用于对一个文件夹里面特定类型的文件名进行批量提取，然后进行批量 %%%%
%%% 修改。即先读取指定路径下的特定类型文件的全部名字，并把名字存在数组变量 %%%%
%%% 中，然后把数组变量写到Excel文件中去，方便自己来修改。%%%%%%%%%%%%%%%%%%%%
%%% author:yetwanng; date:2018-07-14%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

path ='D:\my_data-201508-201710\test-data\IV-test\20170702\';
%此处path是你需要重命名文件所在的完整路径。应当注意文件地址中不要出现空格，否则程序会报错

Files = dir(strcat(path,'*.xlsx'));
%利用dir函数读取相应路径下的特定文件名，我的是xlsx文件

LengthFiles = length(Files);
for i = 1:LengthFiles
    d=Files(i).name;
    f(i)=cellstr(d);%转化为字符串再进行赋值
end
f=f.';%转置一下
xlswrite('C:\Users\ye\Desktop\matlab_rename_data.xlsx',f,'sheet1','A1');
%先将名字数据写入Excel数据中，以便后续在Excel中修改数据，再将修改好的数据重新读取

clear;
clc;