
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%% 本程序是用于对一个文件夹里面特定类型的文件进行固定排序，即本来文件夹里 %%%%
%%% 面文件的顺序是按照你想要的顺序排列的（比如修改时间排序），但是你担心以 %%%%
%%% 后做出一些其他修改会改变固有的顺序，而文件本身又没有按照数字标序，则需 %%%%
%%% 程序执行对文件进行标序来固定排序。所以本程序的作用就是固定文件排序。%%%%%%%
%%% author:yetwanng; date:2018-07-14%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

path ='D:\my_data-201508-201710\test-data\IV-test\20170702\';
%此处path是你需要重命名文件所在的完整路径。应当注意文件地址中不要出现空格，否则程序会报错

Files= dir(strcat(path,'*.xlsx'));
%利用dir函数读取相应路径下的特定文件名，我的是xlsx文件    
for i=1:length(Files)    
    x1=Files(i).name;%取出第一个文件的名称         
    a = sprintf('%03d',i);%类似‘0001’为前缀的命名方式，数字依次递增     
    x2=num2str(a);%转为字符串   
    x3=strcat(x2,'-',x1);
    copyfile([path x1],['D:\处理好的数据\' x3]);%复制到“处理好的数据”文件夹中
end  
clear;
clc;